src/Documents/ИТСервисы_СоглашениеОбУровнеСервиса/ИТСервисы_СоглашениеОбУровнеСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_СоглашениеОбУровнеСервиса</name>
  <basedOn>Document.ИТСервисы_ДоговорСТехническимПровайдером</basedOn>
  <registerRecords>AccumulationRegister.ИТСервисы_ДвижениеДоговоровСервисов</registerRecords>
  <registerRecords>InformationRegister.ИТСервисы_УровниОбслуживания</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Провайдер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРеакцииНаИнцидент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРешенияИнцидента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьСервиса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкноОбслуживания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ИТСервисы_ДвижениеДоговоровСервисов/ИТСервисы_ДвижениеДоговоровСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИТСервисы_ДвижениеДоговоровСервисов</name>
  <resources>
    <name>ВсегоДоговоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоговоров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговоровАктивных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехПровайдер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ИТСервисы_УровниОбслуживания/ИТСервисы_УровниОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_УровниОбслуживания</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРешения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Провайдер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИТСервисы_СоглашениеОбУровнеСервиса/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(ДатаНачала) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SLA.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИТСервисы_СоглашениеОбУровнеСервиса КАК SLA
		|ГДЕ
		|	SLA.ИТСервис = &ИТСервис
		|	И SLA.Ссылка <> &ТекущаяСсылка
		|	И SLA.Проведен = ИСТИНА
		|	И SLA.ДатаНачала <= &ДатаОкончания
		|	И (SLA.ДатаОкончания >= &ДатаНачала ИЛИ SLA.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))";
		
		Запрос.УстановитьПараметр("ИТСервис", ИТСервис);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);

		Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, '39991231'));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "На выбранный период уже существует действующее соглашение по данному сервису!";
			Сообщение.Поле = "ДатаНачала";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИТСервис) И ЗначениеЗаполнено(Провайдер) Тогда
		ДоговорСервиса = ИТСервис.ДоговорСТП;
		
		Если НЕ ЗначениеЗаполнено(ДоговорСервиса) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У выбранного ИТ-Сервиса не указан основной 'Договор с ТП'. Заполните карточку сервиса!";
			Сообщение.Поле = "ИТСервис";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;		
		Иначе
			ПровайдерВСервисе = ДоговорСервиса.ТехПровайдер; 
			Если ПровайдерВСервисе <> Провайдер Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(
					"Ошибка! Провайдер в соглашении (%1) не совпадает с провайдером, указанным в договоре самого ИТ-Сервиса (%2).", 
					Провайдер, 
					ПровайдерВСервисе
				);
				Сообщение.Поле = "Провайдер";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Движения.ИТСервисы_ДвижениеДоговоровСервисов.Записывать = Истина;
	Движения.ИТСервисы_ДвижениеДоговоровСервисов.Очистить();
	
	ЗаписьНакопления = Движения.ИТСервисы_ДвижениеДоговоровСервисов.ДобавитьПриход();
	ЗаписьНакопления.Период       = Дата;
	ЗаписьНакопления.ТехПровайдер = Провайдер;
	
	ЗаписьНакопления.ВсегоДоговоров    = 1;
	ЗаписьНакопления.ДоговоровАктивных = 1;

	Движения.ИТСервисы_УровниОбслуживания.Записывать = Истина;
	Движения.ИТСервисы_УровниОбслуживания.Очистить();
	
	ЗаписьСведений = Движения.ИТСервисы_УровниОбслуживания.Добавить();
	ЗаписьСведений.Период        = Дата;
	ЗаписьСведений.ИТСервис      = ИТСервис;
	ЗаписьСведений.Провайдер     = Провайдер;

	ЗаписьСведений.ВремяРеакции  = ВремяРеакцииНаИнцидент;
	ЗаписьСведений.ВремяРешения  = ВремяРешенияИнцидента;
	ЗаписьСведений.Доступность   = ДоступностьСервиса;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТСервисы_ДоговорСТехническимПровайдером") Тогда
		Основание = ДанныеЗаполнения.Ссылка;
		Провайдер = ДанныеЗаполнения.ТехПровайдер;
		ДатаНачала    = ДанныеЗаполнения.ДатаНачало; 
		ДатаОкончания = ДанныеЗаполнения.ДатаОкончание;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ SLA заполнен на основании договора: " + ДанныеЗаполнения.Номер);	
	КонецЕсли;	
КонецПроцедуры
